quiz/src/DataProcessors/ИграВКвиз/ИграВКвиз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИграВКвиз</name>
  <attributes>
    <name>Квиз</name>
    <type>
      <types>DocumentRef.Квиз</types>
    </type>
  </attributes>
  <attributes>
    <name>Команда</name>
    <type>
      <types>CatalogRef.Команды</types>
    </type>
  </attributes>
  <attributes>
    <name>Раунд</name>
    <type>
      <types>CatalogRef.Раунды</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

quiz/src/InformationRegisters/РезультатыКвиза/РезультатыКвиза.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатыКвиза</name>
  <resources>
    <name>Ответ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Принят</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Квиз</name>
    <type>
      <types>DocumentRef.Квиз</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Команда</name>
    <type>
      <types>CatalogRef.Команды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Раунд</name>
    <type>
      <types>CatalogRef.Раунды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вопрос</name>
    <type>
      <types>CatalogRef.Вопросы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

quiz/src/AccumulationRegisters/ТурнирнаяТаблица/ТурнирнаяТаблица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТурнирнаяТаблица</name>
  <resources>
    <name>КоличествоБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Команда</name>
    <type>
      <types>CatalogRef.Команды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Раунд</name>
    <type>
      <types>CatalogRef.Раунды</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

quiz/src/DataProcessors/ИграВКвиз/Forms/ФормаВедущего/Module.bsl
&НаСервереБезКонтекста
Процедура ИзменитьАктивностьРаунда(Знач Квиз, Знач Раунд) 
	
	Док = Квиз.ПолучитьОбъект();
	СтрокаРаунда = Док.Раунды.Найти(Раунд);
	СтрокаРаунда.Активность = Не СтрокаРаунда.Активность;
	Док.Записать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьСоСписаниемБалловРаунда(Знач Квиз, Знач Раунд) 
	
	Док = Квиз.ПолучитьОбъект();
	СтрокаРаунда = Док.Раунды.Найти(Раунд);
	СтрокаРаунда.СоСписаниемБаллов = Не СтрокаРаунда.СоСписаниемБаллов;
	Док.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура КвизПриИзменении(Элемент)
	
	КвизПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура КвизПриИзмененииНаСервере()
	
	Раунды.Очистить(); 
	Раунды.Загрузить(Объект.Квиз.Раунды.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура РаундыАктивностьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Раунды.ТекущиеДанные;
	ИзменитьАктивностьРаунда(Объект.Квиз, ТекущиеДанные.Раунд);
	Если ТекущиеДанные.Активность тогда
		Объект.Раунд = ТекущиеДанные.Раунд;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаундыСоСписаниемБалловПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Раунды.ТекущиеДанные;
	ИзменитьСоСписаниемБалловРаунда(Объект.Квиз, ТекущиеДанные.Раунд);
КонецПроцедуры

&НаСервере 
Процедура ПолучитьОтветыУчастниковНаСервере()  
	
	Ответы.Очистить();
	Ответы.Загрузить(РегистрыСведений.РезультатыКвиза.ПолучитьРезультатыРаунда(Объект.Квиз, Объект.Раунд)); 
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаОтветы Тогда
		ПолучитьОтветыУчастниковНаСервере();
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаТурнирнаяТаблица Тогда
		СформироватьТурнирнуюТаблицуНаСервере();
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере 
Процедура СформироватьТурнирнуюТаблицуНаСервере()  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТурнирнаяТаблица.Команда КАК Команда,
	|	ТурнирнаяТаблица.Раунд КАК Раунд,
	|	ТурнирнаяТаблица.КоличествоБаллов КАК КоличествоБаллов
	|ИЗ
	|	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	|ГДЕ
	|	ТурнирнаяТаблица.Регистратор = &Регистратор
	|ИТОГИ
	|	СУММА(КоличествоБаллов)
	|ПО
	|	Команда";
	
	Запрос.УстановитьПараметр("Регистратор", Объект.Квиз);
	
	РезультатЗапроса = Запрос.Выполнить();
	ДЗ = РеквизитФормыВЗначение("ТурнирнаяТаблица");
	ДЗ.Строки.Очистить();
	ДЗ = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗначениеВРеквизитФормы(ДЗ, "ТурнирнаяТаблица");
	
КонецПроцедуры



&НаКлиенте
Процедура ЗафиксироватьОтветы(Команда)
	
	ЗафиксироватьОтветыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗафиксироватьОтветыНаСервере()
	
	РегистрыСведений.РезультатыКвиза.ЗаписатьРезультатыРаунда(Объект.Квиз, Объект.Раунд, Ответы);
	Док = Объект.Квиз.ПолучитьОбъект();
	Док.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

&НаСервере
Процедура РаундыПриАктивизацииСтрокиНаСервере(Раунд)
	
	Вопросы.Параметры.УстановитьЗначениеПараметра("Раунд", Раунд);
	
КонецПроцедуры

&НаКлиенте
Процедура РаундыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Раунды.ТекущиеДанные; 
	Если ТекущиеДанные <> Неопределено Тогда
		РаундыПриАктивизацииСтрокиНаСервере(ТекущиеДанные.Раунд);
	КонецЕсли;
	
КонецПроцедуры
